# В общественном транспорте действует система скидок. Если Вы старше 50 лет или младше 14-ти - проезд бесплатный.
# Если Вы студент(14-24 года), проезд за полцены. Программа предлагает ввести год рождения и тариф
# "час", "неделя", "месяц" или "год". Час стоит 60 рублей, неделя 300 рублей, месяц 1000 рублей и год 10 тысяч
# для взрослого человека, не попадающего в льготную категорию. Вычислить стоимость проездного указанного тарифа
# для рассматриваемого гражданина и вывести сообщение на экран.
