# Напишите букву а на экране 1980 раз. 
# print('a' * 1980)

# Нарисуйте "ковёр" 10*10 из букв ш, не используя цикл. 
# print('ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, 'ш' * 10, sep='\n')

# А теперь, используя цикл. Нарисуйте "шахматный" ковёр из букв о и точек. 
# strok = 10
# stolbikov = 20
# stroka = 0
# while stroka < strok:
#     stolbik = 0
#     while stolbik < stolbikov:
#         if (stolbik + stroka) % 2:
#             print('.', end='')
#         else:
#             print('0', end='')
#         stolbik += 1
#     print()
#     stroka += 1

# А теперь, чтоб размер клетки доски был не в один символ, а 3*3. А теперь, m*n.

# TODO: что-то добавить

print('mama mila ramu'[::-1])