# Программа "забывчивая бабушка"
# name = ''
# while True:
#     name = input('Прости сынок, я забыла, как тебя зовут?')
#     if name == 'отстань':
#         break
# print('Сынок, не груби бабушке, будет тебе сто лет, тоже своё имя не вспомнишь!')

# 1. Перепишите программу, избежав break. Для этого напишите условие продолжения цикла

name = ''
while name != 'отстань':
    name = input('Прости сынок, я забыла, как тебя зовут? ')
print('Сынок, не груби бабушке, будет тебе сто лет, тоже своё имя не вспомнишь!')